mysolvers/fluidsimfoam-sedveg/tests/saved_cases/case0/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters   1;

vertices
(
    (0.01 0 0.01)
    (0.01 0.01 0.01)
    (-0.01 0.01 0.01)
    (-0.01 0 0.01)
    (0.01 0 -0.01)
    (0.01 0.01 -0.01)
    (-0.01 0.01 -0.01)
    (-0.01 0 -0.01)
    (0.01 0.13 0.01)
    (-0.01 0.13 0.01)
    (0.01 0.13 -0.01)
    (-0.01 0.13 -0.01)
);

blocks
(
    hex (3 0 4 7 2 1 5 6) (1 1 50) simpleGrading (1 1 1)
    hex (2 1 5 6 9 8 10 11) (1 1 50) simpleGrading (1 1 46.0284)
);

edges
(
);

boundary
(
    inlet
    {
        type              cyclic;
        neighbourPatch    outlet;
        faces
        (
            (3 2 6 7)
            (2 9 11 6)
        );
    }
    outlet
    {
        type              cyclic;
        neighbourPatch    inlet;
        faces
        (
            (0 1 5 4)
            (1 8 10 5)
        );
    }
    top
    {
        type    wall;
        faces
        (
            (9 8 10 11)
        );
    }
    walls
    {
        type    wall;
        faces
        (
            (3 0 4 7)
        );
    }
    frontAndBackPlanes
    {
        type    empty;
        faces
        (
            (4 7 6 5)
            (5 6 11 10)
            (0 3 2 1)
            (1 2 9 8)
        );
    }
);

mergePatchPairs
(

);
