mysolvers/fluidsimfoam-sedveg/tests/saved_cases/case0/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application       sedFoam_rbgh;

startFrom         latestTime;

startTime         0;

stopAt            endTime;

endTime           50;

deltaT            0.02;

writeControl      adjustableRunTime;

writeInterval     5;

purgeWrite        0;

writeFormat       ascii;

writePrecision    6;

writeCompression  off;

timeFormat        general;

timePrecision     6;

runTimeModifiable  true;

adjustTimeStep    true;

maxCo             0.1;

maxAlphaCo        0.1;

maxDeltaT         1.0;
