mysolvers/fluidsimfoam-sedveg/tests/saved_cases/case0/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    p_rbgh
    {
        solver                  GAMG;
        tolerance               1e-06;
        relTol                  0.0001;
        smoother                DIC;
        nPreSweeps              0;
        nPostSweeps             2;
        nFinestSweeps           2;
        cacheAgglomeration      true;
        nCellsInCoarsestLevel   10;
        agglomerator            faceAreaPair;
        mergeLevels             1;
    }
    p_rbghFinal
    {
        $p_rbgh;
        tolerance    1e-06;
        relTol       0;
    }
    "(k.b|epsilon.b|omega.b|pa_new_value|alphaPlastic)"
    {
        solver            PBiCG;
        preconditioner    DILU;
        tolerance         1e-06;
        relTol            0.001;
    }
    "(k.bFinal|ks.bFinal|kw.bFinal|epsilon.bFinal|omega.bFinal|omegas.bFinal|paFinal|alphaPlasticFinal)"
    {
        solver            PBiCG;
        preconditioner    DILU;
        tolerance         1e-09;
        relTol            0;
    }
    alpha.a
    {
        solver            PBiCG;
        preconditioner    DILU;
        tolerance         1e-15;
        relTol            0;
    }
    alpha.aFinal
    {
        solver            PBiCG;
        preconditioner    DILU;
        tolerance         1e-15;
        relTol            0;
    }
    Theta
    {
        solver            PBiCG;
        preconditioner    DILU;
        tolerance         1e-06;
        relTol            0;
    }
    ThetaFinal
    {
        solver            PBiCG;
        preconditioner    DILU;
        tolerance         1e-06;
        relTol            0;
    }
}

PIMPLE
{
    momentumPredictor       0;
    nOuterCorrectors        1;
    nCorrectors             1;
    nNonOrthogonalCorrectors  0;
    correctAlpha            0;
    nAlphaCorr              1;
    pRefCell                0;
    pRefValue               0;
}
